{
    "headline": "Supreme Court grants Trump request to lift stay halting Venezuelan deportations",
    "body": "The Supreme Court on Monday granted President Donald Trump’s request to vacate a lower court's ruling barring the administration from using a 1798 wartime immigration law to immediately deport Venezuelan nationals – including alleged members of the Tren de Aragua gang – from the U.S., marking a significant victory for the administration as it advances key immigration priorities. Justices on the high court ruled 5-4 to grant the administration's request to lift the stay, in a temporary victory for Trump and his allies. At issue was the Alien Enemies Act, or the immigration law passed by Congress in 1789 to immediately remove certain migrants from U.S. soil.  Prior to Trump's second White House term, it had been invoked just three times in U.S. history: During the War of 1812, during World War I, and most recently, World War II. Lawyers for the Trump administration had urged the court to vacate the lower court ruling, arguing in a Supreme Court filing that the lower court orders \"rebuffed\" their immigration agenda, including their ability \"to protect the Nation against foreign terrorist organizations and risk debilitating effects for delicate foreign negotiations.\" \"Today's a bad day to be a terrorist in the United States of America,\" Homeland Security Secretary Kristi Noem said in a video posted to X, adding that Trump \"was correct in using his authority on using the Alien Enemies Act to deport terrorists out of this country.\" Meanwhile, Attorney General Pam Bondi called the \"landmark\" decision a \"victory for the rule of law,\" adding that an \"activist judge\" in Washington, D.C., \"does not have the jurisdiction to seize control of President Trump’s authority to conduct foreign policy and keep the American people safe.\" \"The Department of Justice will continue fighting in court to make America safe again,\" Bondi concluded in her statement responding to the ruling. \"This is a major loss for the lunatics and a major win for the American people,\" Vice President J.D. Vance responded following the High Court's ruling. \"Onward!\" The Supreme Court's ruling follows a temporary order from U.S. District Judge James Boasberg last month blocking the administration’s use of the 1798 law for 14 days while he considered the case on its merits – a pause upheld by a federal appeals court in a 2–1 decision. \"Nazis got better treatment\" than some of the migrants deported under the law, Judge Patricia Millett, an Obama appointee, remarked during the appellate hearing. Both Boasberg and the appellate panel sharply questioned the administration over Trump’s proclamation invoking the Alien Enemies Act to deport Venezuelan nationals – and over the three planes that removed hundreds of migrants to El Salvador the very next day. At least 261 migrants were deported that day, including more than 100 Venezuelans removed \"solely on the basis\" of the 1798 statute. The deportation flights reportedly landed around the same time Boasberg issued his temporary halt, raising questions about whether administration officials knowingly defied the order. Boasberg had issued a bench ruling requiring any flights that had already taken off to return \"immediately.\" That did not happen. Boasberg said on April 3 that he was weighing whether to hold certain Trump administration officials in contempt of court for refusing to provide information, even after the court issued repeated requests regarding the deportation flights and the number of individuals sent to El Salvador. Government lawyers cited national security concerns as the reason for refusing to comply with the court’s request for information. But during the April 3 hearing, Deputy Assistant Attorney General Drew Ensign told Boasberg the flight information likely wasn’t classified — prompting the judge to question why the administration had declined to provide it on more than four occasions, including under a court-imposed deadline. \"Pretty sketchy,\" Boasberg mused in court. Boasberg also pressed the government to disclose the names, locations, and agencies of individuals involved in the removals, as well as any internal conversations with officials who may have been monitoring the court proceedings. The hearing marked the latest in a flurry of legal battles over the Trump administration’s use of the Alien Enemies Act. It followed Boasberg’s order requiring officials to explain why they failed to comply with his directive to return the deportation flights – and whether they knowingly defied the court. The Supreme Court ruling may not mark the end of Trump’s push to invoke the Alien Enemies Act. Boasberg is still weighing potential contempt charges against administration officials. As of this writing, a preliminary injunction hearing is set for April 8. President Trump took to Truth Social to react to the decision in a post: \"The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself. A GREAT DAY FOR JUSTICE IN AMERICA!\" Fox News' Alec Schemmel contributed to this report."
}

